dafoam_pytorch_hfdib_demo/datasets/four_port_64/topology_345/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    // z=0 plane (indices 0-11)
    (0              0              0)
    (0.128    0              0)
    (0.128    0.016   0)
    (0              0.016   0)
    (0              0.032     0)
    (0.128    0.032     0)
    (0.128    0.096   0)
    (0              0.096   0)
    (0              0.112     0)
    (0.128    0.112     0)
    (0.128    0.128     0)
    (0              0.128     0)
    // z=0.002 plane (indices 12-23)
    (0              0              0.002)
    (0.128    0              0.002)
    (0.128    0.016   0.002)
    (0              0.016   0.002)
    (0              0.032     0.002)
    (0.128    0.032     0.002)
    (0.128    0.096   0.002)
    (0              0.096   0.002)
    (0              0.112     0.002)
    (0.128    0.112     0.002)
    (0.128    0.128     0.002)
    (0              0.128     0.002)
);

blocks
(
    // y = 0.000 ... 0.016
    hex (0 1 2 3 12 13 14 15) (64 8 1) simpleGrading (1 1 1)
    // y = 0.016 ... 0.032: lower port strip
    hex (3 2 5 4 15 14 17 16) (64 8 1) simpleGrading (1 1 1)
    // y = 0.032 ... 0.096
    hex (4 5 6 7 16 17 18 19) (64 32 1) simpleGrading (1 1 1)
    // y = 0.096 ... 0.112: upper port strip
    hex (7 6 9 8 19 18 21 20) (64 8 1) simpleGrading (1 1 1)
    // y = 0.112 ... 0.128
    hex (8 9 10 11 20 21 22 23) (64 8 1) simpleGrading (1 1 1)
);

boundary
(
    inletLower
    {
        type patch;
        faces
        (
            (3 15 16 4)
        );
    }
    inletUpper
    {
        type patch;
        faces
        (
            (7 19 20 8)
        );
    }
    outletLower
    {
        type patch;
        faces
        (
            (2 5 17 14)
        );
    }
    outletUpper
    {
        type patch;
        faces
        (
            (6 9 21 18)
        );
    }
    sideWalls
    {
        type wall;
        faces
        (
            (0 12 15 3)
            (1 2 14 13)
            (4 16 19 7)
            (5 6 18 17)
            (8 20 23 11)
            (9 10 22 21)
        );
    }
    topBottomWalls
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (11 23 22 10)
        );
    }
    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
            (3 4 5 2)
            (4 7 6 5)
            (7 8 9 6)
            (8 11 10 9)
            (12 13 14 15)
            (15 14 17 16)
            (16 17 18 19)
            (19 18 21 20)
            (20 21 22 23)
        );
    }
);
